v2206/urban_Microclimate/streetCanyon_CFDHAM/constant/air/viewFactorsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      viewFactorsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Write agglomeration as a volScalarField with calculated boundary values
writeFacesAgglomeration   false;
writeViewFactorMatrix   true;

//Debug option
debug                     1;

//Dump connectivity rays
dumpRays                  false;

maxDynListLength 10000000;

skyPosVector	(0 1 0);

// Per patch (wildcard possible) the coarsening level
inlet
{
    nFacesInCoarsestLevel     10;
    featureAngle              10;
}
outlet
{
    nFacesInCoarsestLevel     10;
    featureAngle              10;
}
top
{
    nFacesInCoarsestLevel     20;
    featureAngle              10;
}
ground
{
    nFacesInCoarsestLevel     50;
    featureAngle              10;
}
air_to_street
{
    nFacesInCoarsestLevel     1000;
    featureAngle              10;
}
air_to_windward
{
    nFacesInCoarsestLevel     1000;
    featureAngle              10;
}
air_to_leeward
{
    nFacesInCoarsestLevel     1000;
    featureAngle              10;
}
side1
{
    nFacesInCoarsestLevel     10;
    featureAngle              10;
}
side2
{
    nFacesInCoarsestLevel     10;
    featureAngle              10;
}
buildings
{
    nFacesInCoarsestLevel     50;
    featureAngle              10;
}

// ************************************************************************* //
